data/WS-Addressing/ws-addressing-36.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:4040/jaxwsa-w3c_s12/cr</To><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:3352d69d-2e28-4e72-bd2a-f793eff44561</MessageID><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/none</Address></ReplyTo><FaultTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/none</Address></FaultTo><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/action/notify</Action></S:Header><S:Body><notify xmlns="http://example.org/notify" xmlns:ns2="http://example.org/echo">test1204</notify></S:Body></S:Envelope>